simulation/airfoil/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;


vertices
(
    ( -100 -150 -50)
    (  600 -150 -50)
    (  600  150 -50)
    ( -100  150 -50)
    ( -100 -150  50)
    (  600 -150  50)
    (  600  150  50)
    ( -100  150  50)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (180 90 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (4 5 6 7)
            (3 7 6 2)
            (3 2 1 0)
        );
    }
);


// ************************************************************************* //
